[Killed] ConditionalExpression
V&V/LabFinal/src/1-BMI.js:3:8
 function calculateBMI(heightInCM, weightInKG)
 {
-    if((heightInCM === '') || (heightInCM < 0) || (isNaN(heightInCM))){
+    if(false || (isNaN(heightInCM))){
         return "Please provide a valid height"; 
     } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please provide a valid height"
Received: "Please provide a valid weight"

[Killed] ConditionalExpression
V&V/LabFinal/src/1-BMI.js:3:8
 function calculateBMI(heightInCM, weightInKG)
 {
-    if((heightInCM === '') || (heightInCM < 0) || (isNaN(heightInCM))){
+    if(false){
         return "Please provide a valid height"; 
     } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please provide a valid height"
Received: "Please provide a valid weight"

[Killed] EqualityOperator
V&V/LabFinal/src/1-BMI.js:5:37
 {
     if((heightInCM === '') || (heightInCM < 0) || (isNaN(heightInCM))){
         return "Please provide a valid height"; 
-    } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){
+    } else if (weightInKG === '' || weightInKG >= 0 || isNaN(weightInKG)){
         return"Please provide a valid weight";
     } else {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "20000.00"
Received: "Please provide a valid weight"

[Killed] ArithmeticOperator
V&V/LabFinal/src/1-BMI.js:8:17
     } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){
         return"Please provide a valid weight";
     } else {
-        return (weightInKG / ((heightInCM*heightInCM)/10000)).toFixed(2);
+        return (weightInKG * (heightInCM * heightInCM / 10000)).toFixed(2);
     }
 }
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "20000.00"
Received: "0.00"
