[Killed] StringLiteral
V&V/LabFinal/src/2-converter.js:8:44
     if(measurement == "ounces")
     {
         result1 = (val/16).toFixed(2) + " pounds";
-        result2 = (val/32000).toFixed(2) + " tons";
+        result2 = (val/32000).toFixed(2) + "";
     } else if(measurement === "pounds") {
         result1 = (val*16).toFixed(2) + " ounces";
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "0.31 pounds",
-   "0.00 tons",

[Killed] EqualityOperator
V&V/LabFinal/src/2-converter.js:12:15
     } else if(measurement === "pounds") {
         result1 = (val*16).toFixed(2) + " ounces";
         result2 = (val/2000).toFixed(2) + " tons";
-    } else if(measurement === "tons") {
+    } else if(measurement !== "tons") {
         result1 = (val*2000).toFixed(2) + " pounds";
         result2 = (val*32000).toFixed(2) + " ounces";
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "wrong input"
Received: ["4000.00 pounds", "64000.00 ounces"]
