[Killed] EqualityOperator
V&V/LabFinal/src/3-sorting.js:3:21
 function bubbleSort(arr) {
     let len = arr.length;
-    for (let i = 0; i < len; i++) {
+    for (let i = 0; i >= len; i++) {
         for (let j = 0; j < len; j++) {
             if (arr[j] > arr[j + 1]) {
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
    2,

[Killed] BlockStatement
V&V/LabFinal/src/3-sorting.js:4:39
 function bubbleSort(arr) {
     let len = arr.length;
     for (let i = 0; i < len; i++) {
-        for (let j = 0; j < len; j++) {
-            if (arr[j] > arr[j + 1]) {
-                let tmp = arr[j];
-                arr[j] = arr[j + 1];
-                arr[j + 1] = tmp;
-            }
-        }
+        for (let j = 0; j < len; j++) {}
     }
     return arr;
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
    2,

[Killed] BlockStatement
V&V/LabFinal/src/3-sorting.js:5:38
     let len = arr.length;
     for (let i = 0; i < len; i++) {
         for (let j = 0; j < len; j++) {
-            if (arr[j] > arr[j + 1]) {
-                let tmp = arr[j];
-                arr[j] = arr[j + 1];
-                arr[j + 1] = tmp;
-            }
+            if (arr[j] > arr[j + 1]) {}
         }
     }
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
    2,
