[Killed] BlockStatement
lab_3/CALCULATOR/src/advanced.js:1:18
-function Pow(x,a){
-    return Math.pow(x,a);
-}
+function Pow(x,a){}
 function GCD(a, b) {
     a = Math.abs(a);
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: undefined

[Killed] BlockStatement
lab_3/CALCULATOR/src/advanced.js:4:20
 function Pow(x,a){
     return Math.pow(x,a);
 }
-function GCD(a, b) {
-    a = Math.abs(a);
-    b = Math.abs(b);
-    while(b) {
-      var t = b;
-      b = a % b;
-      a = t;
-    }
-    return a;
-  }
+function GCD(a, b) {}
 
 function Modulo(a,b){
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ConditionalExpression
lab_3/CALCULATOR/src/advanced.js:7:11
 function GCD(a, b) {
     a = Math.abs(a);
     b = Math.abs(b);
-    while(b) {
+    while(false) {
       var t = b;
       b = a % b;
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Timeout] BlockStatement
lab_3/CALCULATOR/src/advanced.js:7:14
 function GCD(a, b) {
     a = Math.abs(a);
     b = Math.abs(b);
-    while(b) {
-      var t = b;
-      b = a % b;
-      a = t;
-    }
+    while(b) {}
     return a;
   }

[Timeout] ArithmeticOperator
lab_3/CALCULATOR/src/advanced.js:9:11
     b = Math.abs(b);
     while(b) {
       var t = b;
-      b = a % b;
+      b = a * b;
       a = t;
     }

[Killed] BlockStatement
lab_3/CALCULATOR/src/advanced.js:15:21
     return a;
   }
 
-function Modulo(a,b){
-    return a%b;
-}
+function Modulo(a,b){}
 
 module.exports = {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ArithmeticOperator
lab_3/CALCULATOR/src/advanced.js:16:12
   }
 
 function Modulo(a,b){
-    return a%b;
+    return a * b;
 }
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 4
