[Killed] BlockStatement
lab_3/CALCULATOR/src/basic.js:1:18
-function add(a,b){
-    return a+b;
-}
+function add(a,b){}
 
 function substract(a,b){
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ArithmeticOperator
lab_3/CALCULATOR/src/basic.js:2:12
 function add(a,b){
-    return a+b;
+    return a - b;
 }
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -1

[Killed] BlockStatement
lab_3/CALCULATOR/src/basic.js:5:24
     return a+b;
 }
 
-function substract(a,b){
-    return a-b;
-}
+function substract(a,b){}
 
 function multiply(a,b){
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1
Received: undefined

[Killed] ArithmeticOperator
lab_3/CALCULATOR/src/basic.js:6:12
 }
 
 function substract(a,b){
-    return a-b;
+    return a + b;
 }
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1
Received: 3

[Killed] BlockStatement
lab_3/CALCULATOR/src/basic.js:9:23
     return a-b;
 }
 
-function multiply(a,b){
-    return a*b;
-}
+function multiply(a,b){}
 
 function divide(a,b){
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ArithmeticOperator
lab_3/CALCULATOR/src/basic.js:10:12
 }
 
 function multiply(a,b){
-    return a*b;
+    return a / b;
 }
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0.5

[Killed] BlockStatement
lab_3/CALCULATOR/src/basic.js:13:21
     return a*b;
 }
 
-function divide(a,b){
-    return a/b;
-}
+function divide(a,b){}
 
 module.exports = {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.5
Received: undefined

[Killed] ArithmeticOperator
lab_3/CALCULATOR/src/basic.js:14:12
 }
 
 function divide(a,b){
-    return a/b;
+    return a * b;
 }
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.5
Received: 2
